       01  EMPLOYEE-RECORD.
           03  EMPLOYEE-ID             PIC X(5).
           03  FIRST-NAME              PIC X(15).
           03  LAST-NAME               PIC X(20).
           03  EMAIL-ADDRESS           PIC X(30).
           03  EMAIL-ADDRESS2          PIC X(28).
           03  SALARY                  PIC X(9).
           03  DEPARTMENT              PIC X(23).



